###################################################################

# Created by write_sdc on Tue Mar 21 20:52:34 2023

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max WCCOM -max_library                               \
fsa0m_a_generic_core_ss1p62v125c\
                         -min BCCOM -min_library                               \
fsa0m_a_generic_core_ff1p98vm40c
set_wire_load_model -name G5K -library fsa0m_a_generic_core_ss1p62v125c
set_load -pin_load 0.1 [get_ports busy]
set_load -pin_load 0.1 [get_ports ren]
set_load -pin_load 0.1 [get_ports wen]
set_load -pin_load 0.1 [get_ports {caddr_rd[13]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[12]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[11]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[10]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[9]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[8]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[7]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[6]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[5]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[4]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[3]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[2]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[1]}]
set_load -pin_load 0.1 [get_ports {caddr_rd[0]}]
set_load -pin_load 0.1 [get_ports {mdata_wr[7]}]
set_load -pin_load 0.1 [get_ports {mdata_wr[6]}]
set_load -pin_load 0.1 [get_ports {mdata_wr[5]}]
set_load -pin_load 0.1 [get_ports {mdata_wr[4]}]
set_load -pin_load 0.1 [get_ports {mdata_wr[3]}]
set_load -pin_load 0.1 [get_ports {mdata_wr[2]}]
set_load -pin_load 0.1 [get_ports {mdata_wr[1]}]
set_load -pin_load 0.1 [get_ports {mdata_wr[0]}]
set_load -pin_load 0.1 [get_ports {maddr_wr[11]}]
set_load -pin_load 0.1 [get_ports {maddr_wr[10]}]
set_load -pin_load 0.1 [get_ports {maddr_wr[9]}]
set_load -pin_load 0.1 [get_ports {maddr_wr[8]}]
set_load -pin_load 0.1 [get_ports {maddr_wr[7]}]
set_load -pin_load 0.1 [get_ports {maddr_wr[6]}]
set_load -pin_load 0.1 [get_ports {maddr_wr[5]}]
set_load -pin_load 0.1 [get_ports {maddr_wr[4]}]
set_load -pin_load 0.1 [get_ports {maddr_wr[3]}]
set_load -pin_load 0.1 [get_ports {maddr_wr[2]}]
set_load -pin_load 0.1 [get_ports {maddr_wr[1]}]
set_load -pin_load 0.1 [get_ports {maddr_wr[0]}]
set_max_fanout 20 [get_ports clk]
set_max_fanout 20 [get_ports rst]
set_max_fanout 20 [get_ports ready]
set_max_fanout 20 [get_ports {cdata_rd7[15]}]
set_max_fanout 20 [get_ports {cdata_rd7[14]}]
set_max_fanout 20 [get_ports {cdata_rd7[13]}]
set_max_fanout 20 [get_ports {cdata_rd7[12]}]
set_max_fanout 20 [get_ports {cdata_rd7[11]}]
set_max_fanout 20 [get_ports {cdata_rd7[10]}]
set_max_fanout 20 [get_ports {cdata_rd7[9]}]
set_max_fanout 20 [get_ports {cdata_rd7[8]}]
set_max_fanout 20 [get_ports {cdata_rd7[7]}]
set_max_fanout 20 [get_ports {cdata_rd7[6]}]
set_max_fanout 20 [get_ports {cdata_rd7[5]}]
set_max_fanout 20 [get_ports {cdata_rd7[4]}]
set_max_fanout 20 [get_ports {cdata_rd7[3]}]
set_max_fanout 20 [get_ports {cdata_rd7[2]}]
set_max_fanout 20 [get_ports {cdata_rd7[1]}]
set_max_fanout 20 [get_ports {cdata_rd7[0]}]
set_max_fanout 20 [get_ports {cdata_rd6[15]}]
set_max_fanout 20 [get_ports {cdata_rd6[14]}]
set_max_fanout 20 [get_ports {cdata_rd6[13]}]
set_max_fanout 20 [get_ports {cdata_rd6[12]}]
set_max_fanout 20 [get_ports {cdata_rd6[11]}]
set_max_fanout 20 [get_ports {cdata_rd6[10]}]
set_max_fanout 20 [get_ports {cdata_rd6[9]}]
set_max_fanout 20 [get_ports {cdata_rd6[8]}]
set_max_fanout 20 [get_ports {cdata_rd6[7]}]
set_max_fanout 20 [get_ports {cdata_rd6[6]}]
set_max_fanout 20 [get_ports {cdata_rd6[5]}]
set_max_fanout 20 [get_ports {cdata_rd6[4]}]
set_max_fanout 20 [get_ports {cdata_rd6[3]}]
set_max_fanout 20 [get_ports {cdata_rd6[2]}]
set_max_fanout 20 [get_ports {cdata_rd6[1]}]
set_max_fanout 20 [get_ports {cdata_rd6[0]}]
set_max_fanout 20 [get_ports {cdata_rd5[15]}]
set_max_fanout 20 [get_ports {cdata_rd5[14]}]
set_max_fanout 20 [get_ports {cdata_rd5[13]}]
set_max_fanout 20 [get_ports {cdata_rd5[12]}]
set_max_fanout 20 [get_ports {cdata_rd5[11]}]
set_max_fanout 20 [get_ports {cdata_rd5[10]}]
set_max_fanout 20 [get_ports {cdata_rd5[9]}]
set_max_fanout 20 [get_ports {cdata_rd5[8]}]
set_max_fanout 20 [get_ports {cdata_rd5[7]}]
set_max_fanout 20 [get_ports {cdata_rd5[6]}]
set_max_fanout 20 [get_ports {cdata_rd5[5]}]
set_max_fanout 20 [get_ports {cdata_rd5[4]}]
set_max_fanout 20 [get_ports {cdata_rd5[3]}]
set_max_fanout 20 [get_ports {cdata_rd5[2]}]
set_max_fanout 20 [get_ports {cdata_rd5[1]}]
set_max_fanout 20 [get_ports {cdata_rd5[0]}]
set_max_fanout 20 [get_ports {cdata_rd4[15]}]
set_max_fanout 20 [get_ports {cdata_rd4[14]}]
set_max_fanout 20 [get_ports {cdata_rd4[13]}]
set_max_fanout 20 [get_ports {cdata_rd4[12]}]
set_max_fanout 20 [get_ports {cdata_rd4[11]}]
set_max_fanout 20 [get_ports {cdata_rd4[10]}]
set_max_fanout 20 [get_ports {cdata_rd4[9]}]
set_max_fanout 20 [get_ports {cdata_rd4[8]}]
set_max_fanout 20 [get_ports {cdata_rd4[7]}]
set_max_fanout 20 [get_ports {cdata_rd4[6]}]
set_max_fanout 20 [get_ports {cdata_rd4[5]}]
set_max_fanout 20 [get_ports {cdata_rd4[4]}]
set_max_fanout 20 [get_ports {cdata_rd4[3]}]
set_max_fanout 20 [get_ports {cdata_rd4[2]}]
set_max_fanout 20 [get_ports {cdata_rd4[1]}]
set_max_fanout 20 [get_ports {cdata_rd4[0]}]
set_max_fanout 20 [get_ports {cdata_rd3[15]}]
set_max_fanout 20 [get_ports {cdata_rd3[14]}]
set_max_fanout 20 [get_ports {cdata_rd3[13]}]
set_max_fanout 20 [get_ports {cdata_rd3[12]}]
set_max_fanout 20 [get_ports {cdata_rd3[11]}]
set_max_fanout 20 [get_ports {cdata_rd3[10]}]
set_max_fanout 20 [get_ports {cdata_rd3[9]}]
set_max_fanout 20 [get_ports {cdata_rd3[8]}]
set_max_fanout 20 [get_ports {cdata_rd3[7]}]
set_max_fanout 20 [get_ports {cdata_rd3[6]}]
set_max_fanout 20 [get_ports {cdata_rd3[5]}]
set_max_fanout 20 [get_ports {cdata_rd3[4]}]
set_max_fanout 20 [get_ports {cdata_rd3[3]}]
set_max_fanout 20 [get_ports {cdata_rd3[2]}]
set_max_fanout 20 [get_ports {cdata_rd3[1]}]
set_max_fanout 20 [get_ports {cdata_rd3[0]}]
set_max_fanout 20 [get_ports {cdata_rd2[15]}]
set_max_fanout 20 [get_ports {cdata_rd2[14]}]
set_max_fanout 20 [get_ports {cdata_rd2[13]}]
set_max_fanout 20 [get_ports {cdata_rd2[12]}]
set_max_fanout 20 [get_ports {cdata_rd2[11]}]
set_max_fanout 20 [get_ports {cdata_rd2[10]}]
set_max_fanout 20 [get_ports {cdata_rd2[9]}]
set_max_fanout 20 [get_ports {cdata_rd2[8]}]
set_max_fanout 20 [get_ports {cdata_rd2[7]}]
set_max_fanout 20 [get_ports {cdata_rd2[6]}]
set_max_fanout 20 [get_ports {cdata_rd2[5]}]
set_max_fanout 20 [get_ports {cdata_rd2[4]}]
set_max_fanout 20 [get_ports {cdata_rd2[3]}]
set_max_fanout 20 [get_ports {cdata_rd2[2]}]
set_max_fanout 20 [get_ports {cdata_rd2[1]}]
set_max_fanout 20 [get_ports {cdata_rd2[0]}]
set_max_fanout 20 [get_ports {cdata_rd1[15]}]
set_max_fanout 20 [get_ports {cdata_rd1[14]}]
set_max_fanout 20 [get_ports {cdata_rd1[13]}]
set_max_fanout 20 [get_ports {cdata_rd1[12]}]
set_max_fanout 20 [get_ports {cdata_rd1[11]}]
set_max_fanout 20 [get_ports {cdata_rd1[10]}]
set_max_fanout 20 [get_ports {cdata_rd1[9]}]
set_max_fanout 20 [get_ports {cdata_rd1[8]}]
set_max_fanout 20 [get_ports {cdata_rd1[7]}]
set_max_fanout 20 [get_ports {cdata_rd1[6]}]
set_max_fanout 20 [get_ports {cdata_rd1[5]}]
set_max_fanout 20 [get_ports {cdata_rd1[4]}]
set_max_fanout 20 [get_ports {cdata_rd1[3]}]
set_max_fanout 20 [get_ports {cdata_rd1[2]}]
set_max_fanout 20 [get_ports {cdata_rd1[1]}]
set_max_fanout 20 [get_ports {cdata_rd1[0]}]
set_max_fanout 20 [get_ports {cdata_rd0[15]}]
set_max_fanout 20 [get_ports {cdata_rd0[14]}]
set_max_fanout 20 [get_ports {cdata_rd0[13]}]
set_max_fanout 20 [get_ports {cdata_rd0[12]}]
set_max_fanout 20 [get_ports {cdata_rd0[11]}]
set_max_fanout 20 [get_ports {cdata_rd0[10]}]
set_max_fanout 20 [get_ports {cdata_rd0[9]}]
set_max_fanout 20 [get_ports {cdata_rd0[8]}]
set_max_fanout 20 [get_ports {cdata_rd0[7]}]
set_max_fanout 20 [get_ports {cdata_rd0[6]}]
set_max_fanout 20 [get_ports {cdata_rd0[5]}]
set_max_fanout 20 [get_ports {cdata_rd0[4]}]
set_max_fanout 20 [get_ports {cdata_rd0[3]}]
set_max_fanout 20 [get_ports {cdata_rd0[2]}]
set_max_fanout 20 [get_ports {cdata_rd0[1]}]
set_max_fanout 20 [get_ports {cdata_rd0[0]}]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  5  [get_ports rst]
set_input_delay -clock clk  5  [get_ports ready]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[15]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[14]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[13]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[12]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[11]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[10]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[9]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[8]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[7]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[6]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[5]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[4]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[3]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[2]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[1]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd7[0]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[15]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[14]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[13]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[12]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[11]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[10]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[9]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[8]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[7]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[6]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[5]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[4]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[3]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[2]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[1]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd6[0]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[15]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[14]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[13]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[12]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[11]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[10]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[9]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[8]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[7]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[6]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[5]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[4]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[3]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[2]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[1]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd5[0]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[15]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[14]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[13]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[12]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[11]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[10]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[9]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[8]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[7]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[6]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[5]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[4]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[3]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[2]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[1]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd4[0]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[15]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[14]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[13]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[12]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[11]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[10]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[9]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[8]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[7]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[6]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[5]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[4]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[3]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[2]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[1]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd3[0]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[15]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[14]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[13]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[12]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[11]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[10]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[9]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[8]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[7]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[6]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[5]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[4]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[3]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[2]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[1]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd2[0]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[15]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[14]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[13]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[12]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[11]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[10]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[9]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[8]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[7]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[6]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[5]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[4]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[3]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[2]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[1]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd1[0]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[15]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[14]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[13]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[12]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[11]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[10]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[9]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[8]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[7]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[6]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[5]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[4]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[3]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[2]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[1]}]
set_input_delay -clock clk  5  [get_ports {cdata_rd0[0]}]
set_output_delay -clock clk  0.5  [get_ports busy]
set_output_delay -clock clk  0.5  [get_ports ren]
set_output_delay -clock clk  0.5  [get_ports wen]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[13]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[12]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[11]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[10]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[9]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[8]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[7]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[6]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[5]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[4]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[3]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[2]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[1]}]
set_output_delay -clock clk  0.5  [get_ports {caddr_rd[0]}]
set_output_delay -clock clk  0.5  [get_ports {mdata_wr[7]}]
set_output_delay -clock clk  0.5  [get_ports {mdata_wr[6]}]
set_output_delay -clock clk  0.5  [get_ports {mdata_wr[5]}]
set_output_delay -clock clk  0.5  [get_ports {mdata_wr[4]}]
set_output_delay -clock clk  0.5  [get_ports {mdata_wr[3]}]
set_output_delay -clock clk  0.5  [get_ports {mdata_wr[2]}]
set_output_delay -clock clk  0.5  [get_ports {mdata_wr[1]}]
set_output_delay -clock clk  0.5  [get_ports {mdata_wr[0]}]
set_output_delay -clock clk  0.5  [get_ports {maddr_wr[11]}]
set_output_delay -clock clk  0.5  [get_ports {maddr_wr[10]}]
set_output_delay -clock clk  0.5  [get_ports {maddr_wr[9]}]
set_output_delay -clock clk  0.5  [get_ports {maddr_wr[8]}]
set_output_delay -clock clk  0.5  [get_ports {maddr_wr[7]}]
set_output_delay -clock clk  0.5  [get_ports {maddr_wr[6]}]
set_output_delay -clock clk  0.5  [get_ports {maddr_wr[5]}]
set_output_delay -clock clk  0.5  [get_ports {maddr_wr[4]}]
set_output_delay -clock clk  0.5  [get_ports {maddr_wr[3]}]
set_output_delay -clock clk  0.5  [get_ports {maddr_wr[2]}]
set_output_delay -clock clk  0.5  [get_ports {maddr_wr[1]}]
set_output_delay -clock clk  0.5  [get_ports {maddr_wr[0]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports rst]
set_drive 1  [get_ports ready]
set_drive 1  [get_ports {cdata_rd7[15]}]
set_drive 1  [get_ports {cdata_rd7[14]}]
set_drive 1  [get_ports {cdata_rd7[13]}]
set_drive 1  [get_ports {cdata_rd7[12]}]
set_drive 1  [get_ports {cdata_rd7[11]}]
set_drive 1  [get_ports {cdata_rd7[10]}]
set_drive 1  [get_ports {cdata_rd7[9]}]
set_drive 1  [get_ports {cdata_rd7[8]}]
set_drive 1  [get_ports {cdata_rd7[7]}]
set_drive 1  [get_ports {cdata_rd7[6]}]
set_drive 1  [get_ports {cdata_rd7[5]}]
set_drive 1  [get_ports {cdata_rd7[4]}]
set_drive 1  [get_ports {cdata_rd7[3]}]
set_drive 1  [get_ports {cdata_rd7[2]}]
set_drive 1  [get_ports {cdata_rd7[1]}]
set_drive 1  [get_ports {cdata_rd7[0]}]
set_drive 1  [get_ports {cdata_rd6[15]}]
set_drive 1  [get_ports {cdata_rd6[14]}]
set_drive 1  [get_ports {cdata_rd6[13]}]
set_drive 1  [get_ports {cdata_rd6[12]}]
set_drive 1  [get_ports {cdata_rd6[11]}]
set_drive 1  [get_ports {cdata_rd6[10]}]
set_drive 1  [get_ports {cdata_rd6[9]}]
set_drive 1  [get_ports {cdata_rd6[8]}]
set_drive 1  [get_ports {cdata_rd6[7]}]
set_drive 1  [get_ports {cdata_rd6[6]}]
set_drive 1  [get_ports {cdata_rd6[5]}]
set_drive 1  [get_ports {cdata_rd6[4]}]
set_drive 1  [get_ports {cdata_rd6[3]}]
set_drive 1  [get_ports {cdata_rd6[2]}]
set_drive 1  [get_ports {cdata_rd6[1]}]
set_drive 1  [get_ports {cdata_rd6[0]}]
set_drive 1  [get_ports {cdata_rd5[15]}]
set_drive 1  [get_ports {cdata_rd5[14]}]
set_drive 1  [get_ports {cdata_rd5[13]}]
set_drive 1  [get_ports {cdata_rd5[12]}]
set_drive 1  [get_ports {cdata_rd5[11]}]
set_drive 1  [get_ports {cdata_rd5[10]}]
set_drive 1  [get_ports {cdata_rd5[9]}]
set_drive 1  [get_ports {cdata_rd5[8]}]
set_drive 1  [get_ports {cdata_rd5[7]}]
set_drive 1  [get_ports {cdata_rd5[6]}]
set_drive 1  [get_ports {cdata_rd5[5]}]
set_drive 1  [get_ports {cdata_rd5[4]}]
set_drive 1  [get_ports {cdata_rd5[3]}]
set_drive 1  [get_ports {cdata_rd5[2]}]
set_drive 1  [get_ports {cdata_rd5[1]}]
set_drive 1  [get_ports {cdata_rd5[0]}]
set_drive 1  [get_ports {cdata_rd4[15]}]
set_drive 1  [get_ports {cdata_rd4[14]}]
set_drive 1  [get_ports {cdata_rd4[13]}]
set_drive 1  [get_ports {cdata_rd4[12]}]
set_drive 1  [get_ports {cdata_rd4[11]}]
set_drive 1  [get_ports {cdata_rd4[10]}]
set_drive 1  [get_ports {cdata_rd4[9]}]
set_drive 1  [get_ports {cdata_rd4[8]}]
set_drive 1  [get_ports {cdata_rd4[7]}]
set_drive 1  [get_ports {cdata_rd4[6]}]
set_drive 1  [get_ports {cdata_rd4[5]}]
set_drive 1  [get_ports {cdata_rd4[4]}]
set_drive 1  [get_ports {cdata_rd4[3]}]
set_drive 1  [get_ports {cdata_rd4[2]}]
set_drive 1  [get_ports {cdata_rd4[1]}]
set_drive 1  [get_ports {cdata_rd4[0]}]
set_drive 1  [get_ports {cdata_rd3[15]}]
set_drive 1  [get_ports {cdata_rd3[14]}]
set_drive 1  [get_ports {cdata_rd3[13]}]
set_drive 1  [get_ports {cdata_rd3[12]}]
set_drive 1  [get_ports {cdata_rd3[11]}]
set_drive 1  [get_ports {cdata_rd3[10]}]
set_drive 1  [get_ports {cdata_rd3[9]}]
set_drive 1  [get_ports {cdata_rd3[8]}]
set_drive 1  [get_ports {cdata_rd3[7]}]
set_drive 1  [get_ports {cdata_rd3[6]}]
set_drive 1  [get_ports {cdata_rd3[5]}]
set_drive 1  [get_ports {cdata_rd3[4]}]
set_drive 1  [get_ports {cdata_rd3[3]}]
set_drive 1  [get_ports {cdata_rd3[2]}]
set_drive 1  [get_ports {cdata_rd3[1]}]
set_drive 1  [get_ports {cdata_rd3[0]}]
set_drive 1  [get_ports {cdata_rd2[15]}]
set_drive 1  [get_ports {cdata_rd2[14]}]
set_drive 1  [get_ports {cdata_rd2[13]}]
set_drive 1  [get_ports {cdata_rd2[12]}]
set_drive 1  [get_ports {cdata_rd2[11]}]
set_drive 1  [get_ports {cdata_rd2[10]}]
set_drive 1  [get_ports {cdata_rd2[9]}]
set_drive 1  [get_ports {cdata_rd2[8]}]
set_drive 1  [get_ports {cdata_rd2[7]}]
set_drive 1  [get_ports {cdata_rd2[6]}]
set_drive 1  [get_ports {cdata_rd2[5]}]
set_drive 1  [get_ports {cdata_rd2[4]}]
set_drive 1  [get_ports {cdata_rd2[3]}]
set_drive 1  [get_ports {cdata_rd2[2]}]
set_drive 1  [get_ports {cdata_rd2[1]}]
set_drive 1  [get_ports {cdata_rd2[0]}]
set_drive 1  [get_ports {cdata_rd1[15]}]
set_drive 1  [get_ports {cdata_rd1[14]}]
set_drive 1  [get_ports {cdata_rd1[13]}]
set_drive 1  [get_ports {cdata_rd1[12]}]
set_drive 1  [get_ports {cdata_rd1[11]}]
set_drive 1  [get_ports {cdata_rd1[10]}]
set_drive 1  [get_ports {cdata_rd1[9]}]
set_drive 1  [get_ports {cdata_rd1[8]}]
set_drive 1  [get_ports {cdata_rd1[7]}]
set_drive 1  [get_ports {cdata_rd1[6]}]
set_drive 1  [get_ports {cdata_rd1[5]}]
set_drive 1  [get_ports {cdata_rd1[4]}]
set_drive 1  [get_ports {cdata_rd1[3]}]
set_drive 1  [get_ports {cdata_rd1[2]}]
set_drive 1  [get_ports {cdata_rd1[1]}]
set_drive 1  [get_ports {cdata_rd1[0]}]
set_drive 1  [get_ports {cdata_rd0[15]}]
set_drive 1  [get_ports {cdata_rd0[14]}]
set_drive 1  [get_ports {cdata_rd0[13]}]
set_drive 1  [get_ports {cdata_rd0[12]}]
set_drive 1  [get_ports {cdata_rd0[11]}]
set_drive 1  [get_ports {cdata_rd0[10]}]
set_drive 1  [get_ports {cdata_rd0[9]}]
set_drive 1  [get_ports {cdata_rd0[8]}]
set_drive 1  [get_ports {cdata_rd0[7]}]
set_drive 1  [get_ports {cdata_rd0[6]}]
set_drive 1  [get_ports {cdata_rd0[5]}]
set_drive 1  [get_ports {cdata_rd0[4]}]
set_drive 1  [get_ports {cdata_rd0[3]}]
set_drive 1  [get_ports {cdata_rd0[2]}]
set_drive 1  [get_ports {cdata_rd0[1]}]
set_drive 1  [get_ports {cdata_rd0[0]}]
